In [1]:
#pannel data 
import pandas as pd

In [3]:
#1. Series - All the columns are series objects inside 
#2. DataFrame - its a multidimensional table made up of rows and columns

In [4]:
data = {
    'Kholi': [1,2,3,4,5,6],
    'Dhoni': [10,20,30,40,50,60]
}

In [10]:
cricketers = pd.DataFrame(data)

In [11]:
cricketers

   Kholi  Dhoni
0      1     10
1      2     20
2      3     30
3      4     40
4      5     50
5      6     60

In [8]:
cricketers['Dhoni'][0]

10

In [9]:
type(cricketers)

pandas.core.frame.DataFrame

In [13]:
for i in cricketers['Kholi']:
    print(i)

1
2
3
4
5
6

In [ ]:
iterable - any datastructure through which you can iterate (loops)

In [49]:
data = {
    'orange':[3,2,0,1],
    'apples':[0,3,7,12]
}

In [39]:
data = pd.DataFrame(data,index = ['June','July','Aug','Sep'])

In [40]:
data

      orange  apples
June       3       0
July       2       3
Aug        0       7
Sep        1      12

In [47]:
data= data.reset_index()

In [46]:
data.reset_index(drop = True)

  index  orange  apples
0  June       3       0
1  July       2       3
2   Aug       0       7
3   Sep       1      12

In [21]:
data['orange'][0]

3

In [22]:
data['orange']['June']

3

In [23]:
data.shape

(4, 2)

In [50]:
data = pd.DataFrame(data)
data

   orange  apples
0       3       0
1       2       3
2       0       7
3       1      12

In [63]:
lst = [1,2,3,4,5,6]
lst[0:]

[1, 2, 3, 4, 5, 6]

In [71]:
data.iloc[0:3,0:] #-> [rows, columns] #indexing based - integer based location accessing

   orange  apples
0       3       0
1       2       3
2       0       7

In [59]:
data.iloc?

In [79]:
data.loc?

In [84]:
data.loc[[0,1,2],['orange','apples']] #Label based | Alias based location accessing

   orange  apples
0       3       0
1       2       3
2       0       7

In [86]:
data.loc[0:3,['orange','apples']] #Label based | Alias based location accessing

0    3
1    2
2    0
3    1
Name: orange, dtype: int64

In [83]:
data.loc[data['orange'] > 1] #filtering condition

   orange  apples
0       3       0
1       2       3

In [ ]:
data.loc

In [ ]:
[1,2,3,4,5]
[0,1,2,3,4] <-Index
['June','July','Aug','Sep'] <-Alias Index